Revit 2026 API

# TabbedDialogExtension Constructor

---

Constructs a extension instance with a control and ok action handler.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TabbedDialogExtension(
	UserControl userControl,
	TabbedDialogAction onOK
)
```
```vb
Public Sub New (
	userControl As UserControl,
	onOK As TabbedDialogAction
)
```
```cpp
public:
TabbedDialogExtension(
	UserControl^ userControl,
	TabbedDialogAction^ onOK
)
```
```fsharp
new :
        userControl : UserControl *
        onOK : TabbedDialogAction -> TabbedDialogExtension
```

#### Parameters

userControl UserControl
    The control.
onOK TabbedDialogAction
    The ok action handler.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when userControl or onOK is . |
| ArgumentException | Thrown when userControl is already bound to another tabbed dialog. |

#### Reference

TabbedDialogExtension Class

Autodesk.Revit.UI Namespace